---
kind: other
id: Methods.T:Autodesk.Revit.DB.AddInId
source: html/d99709ce-fa33-6e05-e7bd-18b7cffee98c.htm
---
# AddInId Methods

name of addin associated with this AddInId
 Attempts to obtain the name from loaded Third Party AddIns